
//----------------------------------------------------------------------------------
// number타입 (원시타입,객체타입)
let Integer  =123;
let negative = -123;
let double = 1.234;
let bigInt = 1212122112212112n; // 끝에 n붙이기
//2-16진수 표기법
let binary = 0b11111;
let octal = 0o173;
let hex = 0x123;

//0으로나누면, 무한대, -무한대, 이상한 수로 나누면 NaN발생
//에러가아니라~ 
//-----------------------------------------------------------------------------------



//---------------------------------------------------------------------------------
//String 타입
let string ='안녕하슈';
string = '"큰따따옴표"';
string = "'작은따옴표'"; //서로 반대로~

//특수문자 출력
string ='\n줄바꿈';
string ='\t탭';
string ='\\백슬러시 출력';
string ='\u08AC 유니코드출력';

//템플릿 리터럴 (``사용)
let id='엘리';
let greetings = "'안녕,! "+id+"\n 좋은 하루 보내요!'";
console.log(greetings);

greetings = `'안녕, ${id}
즐거운 하루 보내유~!
`;
console.log(greetings);
//+연결 간편하게 해주는 것 템플릿 리터럴

//-------------------------------------------------------------------------------------


//--------------------------------------------------------------------------------------
//불리언 타입
let tr = true;
let fa = false;
//불리언타입은 이런식으로 is를 사용해서 사용
let isFree;
let isActivate;

//Falshy 거짓인 값
console.log(!!0); // 거짓으로 평가 !!는 값을 불리언으로 변환
console.log(!!-0);
console.log(!!'');
console.log(!!null);
console.log(!!undefined);
console.log(!!NaN); //0이아닌값으로 나눔
//Truthy 참인 값
console.log(!!1);
console.log(!!-1);
console.log(!!'te');
console.log(!!{}); // 빈 오브젝트
console.log(!!Infinity);

//---------------------------------------------------------------------------------




//---------------------------------------------------------------------------------
//null과 undefined타입
let vari;
//undefined -정해지지않음 확정된게 없어
 vari =null;
//null -비어있다. 없다! 할당된게! 

console.log(typeof null); // 이건 object type null오브젝트 할당해서 null표현
console.log(typeof undefined); // undefined type

//---------------------------------------------------------------------------

